<?php

//$a에 5를 대입하기
$a=5;
echo $a ."<br>";

//$a에 $a+5를 대입하기
$a+=5;
echo $a."<br>";

//$a에 $a-5를 대입하기
$a-=5;
echo $a."<br>";

//$a에 $a/5를 대입하기
$a/=5;
echo $a."<br>";

//$a에 $a%5(5로 나눴을 때 나머지값)을 대입하기
$a%=5;
echo $a."<br>";

//$a에 @를 붙이는 것을 출력하기
$a.="@";
echo $a."<br>";

/*비교 연산자
    == : 두 변수의 값이 같으면 true, 다르면 false
    != : 두 변수의 값이 다르면 true, 같으면 false
 */

 /*논리 연산자
    $x and $y : 두 변수가 참이어야 한다.(참값일 대의 서로 비교)
    $x && $y : = $x and $y 
    $x or $y : 두 변수 중 하나만 참이여도 참으로 인정
    $x || $y : = $x or $y
    

 */
?>